Ran Plan for dir: `projects/dev` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/goboolean/infrastructure/90/default/projects/dev/default.tfplan\"" in "/root/.atlantis/repos/goboolean/infrastructure/90/default/projects/dev": exit status 1
module.acme.tls_private_key.private_key: Refreshing state... [id=3b6fbbc04df1b62ea59e2ed339f7bef7243ccf98]
module.acme.acme_registration.reg: Refreshing state... [id=https://acme-staging-v02.api.letsencrypt.org/acme/acct/182146964]
module.gke.data.google_client_config.default: Reading...
module.gke.google_compute_network.vpc: Refreshing state... [id=projects/goboolean-448812/global/networks/goboolean-448812-vpc]
module.gke.data.google_container_engine_versions.gke_version: Reading...
module.gcs.google_storage_bucket.terraform_state: Refreshing state... [id=goboolean-terraform-state]
module.iam.google_service_account.atlantis: Refreshing state... [id=projects/goboolean-448812/serviceAccounts/atlantis@goboolean-448812.iam.gserviceaccount.com]
module.gke.data.google_client_config.default: Read complete after 0s [id=projects/"goboolean-448812"/regions/"asia-northeast3"/zones/<null>]
module.gce.google_compute_firewall.allow_http_https: Refreshing state... [id=projects/goboolean-448812/global/firewalls/allow-http-https]
module.service.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=goboolean-448812/compute.googleapis.com]
module.service.google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=goboolean-448812/cloudresourcemanager.googleapis.com]
module.service.google_project_service.services["container.googleapis.com"]: Refreshing state... [id=goboolean-448812/container.googleapis.com]
module.gce.google_compute_address.static_ip: Refreshing state... [id=projects/goboolean-448812/regions/asia-northeast3/addresses/atlantis-static-ip]
module.service.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=goboolean-448812/iam.googleapis.com]
module.gke.data.google_container_engine_versions.gke_version: Read complete after 0s [id=2025-01-31 15:08:02.926078217 +0000 UTC]
module.service.google_project_service.services["serviceusage.googleapis.com"]: Refreshing state... [id=goboolean-448812/serviceusage.googleapis.com]
module.gke.google_compute_subnetwork.subnet: Refreshing state... [id=projects/goboolean-448812/regions/asia-northeast3/subnetworks/goboolean-448812-subnet]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke]
module.acme.acme_certificate.certificate: Refreshing state... [id=224e11bc-998b-e278-dd24-d91d3595adf3]
module.gke.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke/nodePools/goboolean-448812-gke]
module.iam.google_project_iam_member.owner: Refreshing state... [id=goboolean-448812/roles/owner/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.compute_network_admin: Refreshing state... [id=goboolean-448812/roles/compute.networkAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.iam_admin: Refreshing state... [id=goboolean-448812/roles/resourcemanager.projectIamAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.service_account_admin: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountAdmin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_storage_bucket_iam_member.terraform_state_access: Refreshing state... [id=b/goboolean-terraform-state/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.service_account_user: Refreshing state... [id=goboolean-448812/roles/iam.serviceAccountUser/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.storage_admin: Refreshing state... [id=goboolean-448812/roles/storage.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.gke_admin: Refreshing state... [id=goboolean-448812/roles/container.admin/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.iam.google_project_iam_member.compute_instance_admin: Refreshing state... [id=goboolean-448812/roles/compute.instanceAdmin.v1/serviceAccount:atlantis@goboolean-448812.iam.gserviceaccount.com]
module.namespace.kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
module.namespace.kubernetes_namespace.fetch-system: Refreshing state... [id=fetch-system]
module.namespace.kubernetes_namespace.vault: Refreshing state... [id=vault]
module.namespace.kubernetes_namespace.harbor: Refreshing state... [id=harbor]
module.namespace.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.gce.google_compute_instance.default: Refreshing state... [id=projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis]
module.istio.helm_release.istio_base: Refreshing state... [id=istio-base]
module.harbor.helm_release.harbor: Refreshing state... [id=harbor]
module.vault.helm_release.vault: Refreshing state... [id=vault]
module.cert_manager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.argocd.data.kustomization_build.argocd: Reading...
module.cert_manager.kubernetes_secret.cloudflare_api_token: Refreshing state... [id=cert-manager/cloudflare-api-token-secret]
module.istio.helm_release.istiod: Refreshing state... [id=istiod]
module.istio.helm_release.istio_ingressgateway: Refreshing state... [id=istio-ingressgateway]
module.istio.data.kubernetes_service.istio_ingressgateway: Reading...
module.istio.data.kubernetes_service.istio_ingressgateway: Read complete after 0s [id=istio-system/istio-ingressgateway]
module.istio.kubernetes_manifest.istio_gateway: Refreshing state...
module.harbor.kubernetes_manifest.harbor_gateway: Refreshing state...
module.cloudflare.cloudflare_dns_record.istio-gateway: Refreshing state... [id=5b3805bf479bd12a29aad2877a6cfdfa]
module.cert_manager.kubernetes_manifest.cluster_issuer: Refreshing state...
module.vault.kubernetes_manifest.vault_gateway: Refreshing state...
module.argocd.data.kustomization_build.argocd: Still reading... [10s elapsed]
module.cert_manager.kubernetes_manifest.wildcard_certificate: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.argocd.kubernetes_manifest.argocd_repo_server_role will be created
  + resource "kubernetes_manifest" "argocd_repo_server_role" {
      + manifest = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "Role"
          + metadata   = {
              + name      = "argocd-repo-server-role"
              + namespace = "argocd"
            }
          + rules      = [
              + {
                  + apiGroups     = [
                      + "",
                    ]
                  + resourceNames = [
                      + "argocd-vault-plugin-credentials",
                    ]
                  + resources     = [
                      + "secrets",
                    ]
                  + verbs         = [
                      + "get",
                    ]
                },
            ]
        }
      + object   = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "Role"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-repo-server-role"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + rules      = [
              + {
                  + apiGroups       = [
                      + "",
                    ]
                  + nonResourceURLs = (known after apply)
                  + resourceNames   = [
                      + "argocd-vault-plugin-credentials",
                    ]
                  + resources       = [
                      + "secrets",
                    ]
                  + verbs           = [
                      + "get",
                    ]
                },
            ]
        }
    }

  # module.argocd.kubernetes_manifest.argocd_vault_plugin_rolebinding will be created
  + resource "kubernetes_manifest" "argocd_vault_plugin_rolebinding" {
      + manifest = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "RoleBinding"
          + metadata   = {
              + name      = "argocd-repo-server-rolebinding"
              + namespace = "argocd"
            }
          + roleRef    = {
              + apiGroup = "rbac.authorization.k8s.io"
              + kind     = "Role"
              + name     = "argocd-repo-server-role"
            }
          + subjects   = [
              + {
                  + kind      = "ServiceAccount"
                  + name      = "argocd-repo-server"
                  + namespace = "argocd"
                },
            ]
        }
      + object   = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "RoleBinding"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-repo-server-rolebinding"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + roleRef    = {
              + apiGroup = "rbac.authorization.k8s.io"
              + kind     = "Role"
              + name     = "argocd-repo-server-role"
            }
          + subjects   = [
              + {
                  + apiGroup  = (known after apply)
                  + kind      = "ServiceAccount"
                  + name      = "argocd-repo-server"
                  + namespace = "argocd"
                },
            ]
        }
    }

  # module.argocd.kubernetes_secret.argocd_vault_plugin_credentials will be created
  + resource "kubernetes_secret" "argocd_vault_plugin_credentials" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-vault-plugin-credentials"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Error: kustomizationBuild: Kustomizer Run for path '../../modules/infra/argocd/base' failed: no matches for Id Deployment.v1.apps/argocd-server.argocd; failed to find unique target for patch Deployment.v1.apps/argocd-server.argocd
│ 
│   with module.argocd.data.kustomization_build.argocd,
│   on ../../modules/infra/argocd/main.tf line 1, in data "kustomization_build" "argocd":
│    1: data "kustomization_build" "argocd" {
│ 
╵


```
</details>

